# -*- coding: utf-8 -*-

private_key = "ec279d_SmartWeatherAPI_7dd10fe";
app_id = "192bc2fe394b004b";
fixed_url = "http://webapi.weather.com.cn/data/";
weather_code = {'00' : u'晴',
				'01' : u'多云',
				'02' : u'阴',
				'03' : u'阵雨',
				'04' : u'雷阵雨',
				'05' : u'雷阵雨伴有冰雹',
				'06' : u'雨夹雪',
				'07' : u'小雨',
				'08' : u'中雨',
				'09' : u'大雨',
				'10' : u'暴雨',
				'11' : u'大暴雨',
				'12' : u'特大暴雨',
				'13' : u'阵雪',
				'14' : u'小雪',
				'15' : u'中雪',
				'16' : u'大雪',
				'17' : u'暴雨',
				'18' : u'雾',
				'19' : u'冻雨',
				'20' : u'沙尘暴',
				'21' : u'小到中雨',
				'22' : u'中到大雨',
				'23' : u'大到暴雨',
				'24' : u'暴雨到大暴雨',
				'25' : u'大暴雨到特大暴雨',
				'26' : u'小到中雪',
				'27' : u'中到大雪',
				'28' : u'大到暴雪',
				'29' : u'浮尘',
				'30' : u'扬沙',
				'31' : u'强沙尘暴',
				'53' : u'霾',
				'99' : u'无'
};
wind_direct_code = [u'无持续风向', u'东北风', u'东方', u'东南风', u'南风', u'西南风', u'西风', u'西北风', u'北风', u'旋转风'];
wind_power_code = [u'微风', u'3-4级', u'4-5级', u'5-6级', u'6-7级', u'7-8级', u'8-9级', u'9-10级', u'11-12级'];
weeks = ['星期日', '星期一', '星期二', '星期三', '星期四', '星期五', '星期六'];